DAUoverset-4.1/tutorials/hollowCylinderWithBaseMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }

    p
    {
        solver          PBiCGStab; 
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    pFinal
    {
        $p;
    }

    pcorr
    {
        $p;
        solver          PCG;
        preconditioner  DIC;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{

    momentumPredictor   yes;

    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;

    correctPhi          no;
    moveMeshOuterCorrectors no;
    turbOnFinalIterOnly yes;

    maxCo               0.5;
    maxAlphaCo          0.5;
    rDeltaTSmoothingCoeff 0.5;
    rDeltaTDampingCoeff 0.2;
    nAlphaSpreadIter    0;
    nAlphaSweepIter     0;
    maxDeltaT           0.1;

    cAlpha              0;

    pRefCell            0;
    pRefValue           0.0;
}

relaxationFactors
{
   fields
   {
   }
   equations
   {
       ".*"             1;
   }
}


// ************************************************************************* //
